Show / Hide Table of Contents
Class CheckResConcreteBlock
Check value for Concrete Block
Inheritance
System.Object
CheckResConcreteBlock
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class CheckResConcreteBlock
Properties
Improve this Doc   View Source
CheckStatus
Status of the Check
Declaration
[DataMember]
public bool CheckStatus { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
LoadCaseId
Id of Load Case
Declaration
[DataMember]
public int LoadCaseId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Name of Concrete Block
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
UnityCheck
Unity Check
Declaration
[DataMember]
public double UnityCheck { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source